MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/btzbsys.h
/* -------- BTZBSYS_SUBSYS_STATUS_REG1 : (BTZBSYS Offset: 0x24) (R/W 32) SUBSYS_STATUS_REG1 -------- */
#define BTZBSYS_SUBSYS_STATUS_REG1_RESETVALUE _UINT32_(0x00)                                       /*  (BTZBSYS_SUBSYS_STATUS_REG1) SUBSYS_STATUS_REG1  Reset Value */

#define BTZBSYS_SUBSYS_STATUS_REG1_xtal_ready_out_Pos _UINT32_(0)                                          /* (BTZBSYS_SUBSYS_STATUS_REG1) xtal_ready_out Position */
#define BTZBSYS_SUBSYS_STATUS_REG1_xtal_ready_out_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG1_xtal_ready_out_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG1) xtal_ready_out Mask */
#define BTZBSYS_SUBSYS_STATUS_REG1_xtal_ready_out(value) (BTZBSYS_SUBSYS_STATUS_REG1_xtal_ready_out_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG1_xtal_ready_out_Pos)) /* Assigment of value for xtal_ready_out in the BTZBSYS_SUBSYS_STATUS_REG1 register */
#define BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_out_Pos _UINT32_(1)                                          /* (BTZBSYS_SUBSYS_STATUS_REG1) pll_lock_out Position */
#define BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_out_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_out_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG1) pll_lock_out Mask */
#define BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_out(value) (BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_out_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_out_Pos)) /* Assigment of value for pll_lock_out in the BTZBSYS_SUBSYS_STATUS_REG1 register */
#define BTZBSYS_SUBSYS_STATUS_REG1_XTAL_ready_Pos _UINT32_(2)                                          /* (BTZBSYS_SUBSYS_STATUS_REG1) XTAL_ready Position */
#define BTZBSYS_SUBSYS_STATUS_REG1_XTAL_ready_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG1_XTAL_ready_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG1) XTAL_ready Mask */
#define BTZBSYS_SUBSYS_STATUS_REG1_XTAL_ready(value) (BTZBSYS_SUBSYS_STATUS_REG1_XTAL_ready_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG1_XTAL_ready_Pos)) /* Assigment of value for XTAL_ready in the BTZBSYS_SUBSYS_STATUS_REG1 register */
#define BTZBSYS_SUBSYS_STATUS_REG1_PLL_locked_Pos _UINT32_(3)                                          /* (BTZBSYS_SUBSYS_STATUS_REG1) PLL_locked Position */
#define BTZBSYS_SUBSYS_STATUS_REG1_PLL_locked_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG1_PLL_locked_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG1) PLL_locked Mask */
#define BTZBSYS_SUBSYS_STATUS_REG1_PLL_locked(value) (BTZBSYS_SUBSYS_STATUS_REG1_PLL_locked_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG1_PLL_locked_Pos)) /* Assigment of value for PLL_locked in the BTZBSYS_SUBSYS_STATUS_REG1 register */
#define BTZBSYS_SUBSYS_STATUS_REG1_clk_lp_ready_Pos _UINT32_(4)                                          /* (BTZBSYS_SUBSYS_STATUS_REG1) clk_lp_ready Position */
#define BTZBSYS_SUBSYS_STATUS_REG1_clk_lp_ready_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG1_clk_lp_ready_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG1) clk_lp_ready Mask */
#define BTZBSYS_SUBSYS_STATUS_REG1_clk_lp_ready(value) (BTZBSYS_SUBSYS_STATUS_REG1_clk_lp_ready_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG1_clk_lp_ready_Pos)) /* Assigment of value for clk_lp_ready in the BTZBSYS_SUBSYS_STATUS_REG1 register */
#define BTZBSYS_SUBSYS_STATUS_REG1_Msk        _UINT32_(0x0000001F)                                 /* (BTZBSYS_SUBSYS_STATUS_REG1) Register Mask  */


/** \brief BTZBSYS register offsets definitions */
#define BTZBSYS_SUBSYS_CNTRL_REG0_REG_OFST _UINT32_(0x00)      /* (BTZBSYS_SUBSYS_CNTRL_REG0) SUBSYS_CNTRL_REG0 Offset */
#define BTZBSYS_SUBSYS_CNTRL_REG1_REG_OFST _UINT32_(0x04)      /* (BTZBSYS_SUBSYS_CNTRL_REG1) SUBSYS_CNTRL_REG1 Offset */
#define BTZBSYS_SUBSYS_STATUS_REG0_REG_OFST _UINT32_(0x20)      /* (BTZBSYS_SUBSYS_STATUS_REG0) SUBSYS_STATUS_REG0 Offset */
#define BTZBSYS_SUBSYS_STATUS_REG1_REG_OFST _UINT32_(0x24)      /* (BTZBSYS_SUBSYS_STATUS_REG1) SUBSYS_STATUS_REG1 Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief BTZBSYS register API structure */
typedef struct
{  /*  */
  __IO  uint32_t                       BTZBSYS_SUBSYS_CNTRL_REG0; /**< Offset: 0x00 (R/W  32) SUBSYS_CNTRL_REG0 */
  __IO  uint32_t                       BTZBSYS_SUBSYS_CNTRL_REG1; /**< Offset: 0x04 (R/W  32) SUBSYS_CNTRL_REG1 */
  __I   uint8_t                        Reserved1[0x18];
  __IO  uint32_t                       BTZBSYS_SUBSYS_STATUS_REG0; /**< Offset: 0x20 (R/W  32) SUBSYS_STATUS_REG0 */
  __IO  uint32_t                       BTZBSYS_SUBSYS_STATUS_REG1; /**< Offset: 0x24 (R/W  32) SUBSYS_STATUS_REG1 */
} btzbsys_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _BZ45_BTZBSYS_COMPONENT_H_ */
